target/karate-reports/features.JavaUtilityInjection-CreateAppointment.karate-json.txt

{"failedCount":0,"prefixedPath":"classpath:features\/JavaUtilityInjection-CreateAppointment.feature","packageQualifiedName":"features.JavaUtilityInjection-CreateAppointment","loopIndex":-1,"relativePath":"features\/JavaUtilityInjection-CreateAppointment.feature","scenarioResults":[{"sectionIndex":0,"stepResults":[{"result":{"nanos":1511500,"startTime":1753623166920,"endTime":1753623166922,"millis":1.5115,"status":"passed"},"step":{"background":true,"line":4,"prefix":"*","index":0,"text":"url userSoapUrl"},"stepLog":"19:02:46.875 🔢 Users to create: 5 \n"},{"result":{"nanos":1588863600,"startTime":1753623166925,"endTime":1753623168514,"millis":1588.8636,"status":"passed"},"step":{"background":true,"line":5,"prefix":"*","index":1,"text":"def result = call read('classpath:features\/UserLogin.feature')"},"callResults":[{"failedCount":0,"prefixedPath":"classpath:features\/UserLogin.feature","packageQualifiedName":"features.UserLogin","loopIndex":-1,"relativePath":"features\/UserLogin.feature","scenarioResults":[{"sectionIndex":0,"stepResults":[{"result":{"nanos":9406500,"startTime":1753623166957,"endTime":1753623166966,"millis":9.4065,"status":"passed"},"step":{"background":true,"line":4,"prefix":"*","index":0,"text":"url userSoapUrl"}},{"result":{"nanos":1419200,"startTime":1753623166967,"endTime":1753623166968,"millis":1.4192,"status":"passed"},"step":{"comments":["########################### userLogin Sender###############################################################"],"line":9,"prefix":"*","index":0,"text":"def username = 'xyz2313490priyankatalekar5@qa-u56-singlenode-ps.eng.zimbra.com'"}},{"result":{"nanos":966200,"startTime":1753623166968,"endTime":1753623166969,"millis":0.9662,"status":"passed"},"step":{"line":10,"prefix":"*","index":1,"text":"def password = 'Welcome123'"}},{"result":{"nanos":105768700,"startTime":1753623166970,"endTime":1753623167076,"millis":105.7687,"status":"passed"},"step":{"line":11,"prefix":"*","index":2,"text":"def env = karate.read('classpath:requests\/authRequestUser.xml')"}},{"result":{"nanos":2416700,"startTime":1753623167076,"endTime":1753623167078,"millis":2.4167,"status":"passed"},"step":{"line":12,"prefix":"Given","index":3,"text":"request env"}},{"result":{"nanos":1302100,"startTime":1753623167079,"endTime":1753623167080,"millis":1.3021,"status":"passed"},"step":{"line":13,"prefix":"And","index":4,"text":"header Content-Type = 'application\/soap+xml'"}},{"result":{"nanos":433426800,"startTime":1753623167080,"endTime":1753623167513,"millis":433.4268,"status":"passed"},"step":{"line":14,"prefix":"*","index":5,"text":"configure ssl = true"}},{"result":{"nanos":853493400,"startTime":1753623167514,"endTime":1753623168367,"millis":853.4934,"status":"passed"},"step":{"line":15,"prefix":"When","index":6,"text":"method POST"},"stepLog":"19:02:47.949 request:\n1 > POST https:\/\/80.225.207.85\/service\/soap\/\n1 > Content-Type: application\/soap+xml; charset=UTF-8\n1 > Content-Length: 359\n1 > Host: 80.225.207.85\n1 > Connection: Keep-Alive\n1 > User-Agent: Apache-HttpClient\/4.5.14 (Java\/21.0.7)\n1 > Accept-Encoding: gzip,deflate\n<soap:Envelope xmlns:soap=\"http:\/\/www.w3.org\/2003\/05\/soap-envelope\">\r\n  <soap:Header\/>\r\n  <soap:Body>\r\n    <AuthRequest xmlns=\"urn:zimbraAccount\" csrfTokenSecured=\"1\">\r\n      <account by=\"name\">xyz2313490priyankatalekar5@qa-u56-singlenode-ps.eng.zimbra.com<\/account>\r\n      <password>Welcome123<\/password>\r\n    <\/AuthRequest>\r\n  <\/soap:Body>\r\n<\/soap:Envelope>\n\n19:02:48.357 response time in milliseconds: 392\n1 < 200\n1 < Server: nginx\n1 < Date: Sun, 27 Jul 2025 13:32:45 GMT\n1 < Content-Type: text\/xml;charset=utf-8\n1 < Content-Length: 700\n1 < Connection: keep-alive\n1 < Set-Cookie: ZM_AUTH_TOKEN=0_5b274af34569381f5c166b1dfc808d426cc4c1ad_69643d33363a38303439303461372d346463302d346365642d626437332d6136393836376563653234383b6578703d31333a313735333739353936353333383b747970653d363a7a696d6272613b753d313a613b7469643d393a3337353939323531313b76657273696f6e3d31343a31302e312e305f47415f343635353b637372663d313a313b; Path=\/; Secure; HttpOnly\n1 < Expires: Thu, 01 Jan 1970 00:00:00 GMT\n1 < X-Zimbra-Csrf-Token: 0_b5ec7042a8441bb6bd0cdc9da3d21567ee04afd4\n1 < Cache-Control: no-store, no-cache\n1 < Vary: Accept-Encoding, User-Agent\n<soap:Envelope xmlns:soap=\"http:\/\/www.w3.org\/2003\/05\/soap-envelope\"><soap:Header><context xmlns=\"urn:zimbra\"><change token=\"1138\"\/><\/context><\/soap:Header><soap:Body><AuthResponse xmlns=\"urn:zimbraAccount\"><authToken>0_5b274af34569381f5c166b1dfc808d426cc4c1ad_69643d33363a38303439303461372d346463302d346365642d626437332d6136393836376563653234383b6578703d31333a313735333739353936353333383b747970653d363a7a696d6272613b753d313a613b7469643d393a3337353939323531313b76657273696f6e3d31343a31302e312e305f47415f343635353b637372663d313a313b<\/authToken><lifetime>172799999<\/lifetime><skin>harmony<\/skin><csrfToken>0_b5ec7042a8441bb6bd0cdc9da3d21567ee04afd4<\/csrfToken><\/AuthResponse><\/soap:Body><\/soap:Envelope>\n\n"},{"result":{"nanos":6707900,"startTime":1753623168367,"endTime":1753623168374,"millis":6.7079,"status":"passed"},"step":{"line":16,"prefix":"Then","index":7,"text":"status 200"}},{"result":{"nanos":116607700,"startTime":1753623168374,"endTime":1753623168491,"millis":116.6077,"status":"passed"},"step":{"line":17,"prefix":"*","index":8,"text":"def userAuthToken = karate.xmlPath(response, '\/\/authToken')"}},{"result":{"nanos":3491300,"startTime":1753623168492,"endTime":1753623168495,"millis":3.4913,"status":"passed"},"step":{"line":18,"prefix":"*","index":9,"text":"print 'Auth Token is:', userAuthToken"},"stepLog":"19:02:48.495 [print] Auth Token is: 0_5b274af34569381f5c166b1dfc808d426cc4c1ad_69643d33363a38303439303461372d346463302d346365642d626437332d6136393836376563653234383b6578703d31333a313735333739353936353333383b747970653d363a7a696d6272613b753d313a613b7469643d393a3337353939323531313b76657273696f6e3d31343a31302e312e305f47415f343635353b637372663d313a313b \n"},{"result":{"nanos":10221700,"startTime":1753623168495,"endTime":1753623168505,"millis":10.2217,"status":"passed"},"step":{"line":19,"prefix":"*","index":10,"text":"def csfrToken = karate.xmlPath(response,'\/\/csrfToken')"}},{"result":{"nanos":1598500,"startTime":1753623168506,"endTime":1753623168508,"millis":1.5985,"status":"passed"},"step":{"line":20,"prefix":"*","index":11,"text":"print 'csrfToken is:', csfrToken"},"stepLog":"19:02:48.507 [print] csrfToken is: 0_b5ec7042a8441bb6bd0cdc9da3d21567ee04afd4 \n"}],"line":7,"description":"","durationMillis":1546.8267,"failed":false,"tags":["SmokeTest1"],"executorName":"main","name":"Send Email from one Account to Another Account using SOAP API and Verify User Received Successfully","startTime":1753623166957,"refId":"[1:7]","endTime":1753623168507,"exampleIndex":-1}],"callDepth":1,"name":"Send Email from one Account to Another Account using SOAP API","description":"","resultDate":"2025-07-27 07:02:48 pm","durationMillis":1546.8267,"passedCount":1}]},{"result":{"nanos":2101200,"startTime":1753623168514,"endTime":1753623168516,"millis":2.1012,"status":"passed"},"step":{"background":true,"line":6,"prefix":"*","index":2,"text":"def authToken = result.userAuthToken"}},{"result":{"nanos":2153200,"startTime":1753623168516,"endTime":1753623168518,"millis":2.1532,"status":"passed"},"step":{"background":true,"line":7,"prefix":"*","index":3,"text":"print authToken"},"stepLog":"19:02:48.517 [print] 0_5b274af34569381f5c166b1dfc808d426cc4c1ad_69643d33363a38303439303461372d346463302d346365642d626437332d6136393836376563653234383b6578703d31333a313735333739353936353333383b747970653d363a7a696d6272613b753d313a613b7469643d393a3337353939323531313b76657273696f6e3d31343a31302e312e305f47415f343635353b637372663d313a313b \n"},{"result":{"nanos":1726400,"startTime":1753623168518,"endTime":1753623168520,"millis":1.7264,"status":"passed"},"step":{"background":true,"line":8,"prefix":"*","index":4,"text":"def csrfToken = result.csfrToken"}},{"result":{"nanos":1765400,"startTime":1753623168520,"endTime":1753623168522,"millis":1.7654,"status":"passed"},"step":{"background":true,"line":9,"prefix":"*","index":5,"text":"print csrfToken"},"stepLog":"19:02:48.521 [print] 0_b5ec7042a8441bb6bd0cdc9da3d21567ee04afd4 \n"},{"result":{"nanos":1559400,"startTime":1753623168522,"endTime":1753623168524,"millis":1.5594,"status":"passed"},"step":{"background":true,"line":10,"prefix":"*","index":6,"text":"def username = result.username"}},{"result":{"nanos":9570600,"startTime":1753623168524,"endTime":1753623168534,"millis":9.5706,"status":"passed"},"step":{"background":true,"line":11,"prefix":"*","index":7,"text":"def env = karate.read('classpath:requests\/soap-envelope.xml')"}},{"result":{"nanos":9896000,"startTime":1753623168534,"endTime":1753623168544,"millis":9.896,"status":"passed"},"step":{"background":true,"line":12,"prefix":"*","index":8,"text":"def XmlTemplateProcessor = Java.type('utils.XmlTemplateProcessor')"}},{"result":{"nanos":44855600,"startTime":1753623168544,"endTime":1753623168589,"millis":44.8556,"status":"passed"},"step":{"comments":["# Define appointment data"],"line":16,"prefix":"*","index":0,"text":"def appointment = { subject: \"Team Meeting\", location: \"Conference Room A\", content: \"Discuss project updates\" }"}},{"result":{"nanos":1424400,"startTime":1753623168588,"endTime":1753623168589,"millis":1.4244,"status":"passed"},"step":{"line":17,"prefix":"*","index":1,"text":"def attendee = \"qauser_f8b093fa@qa-u56-singlenode-ps.eng.zimbra.com\""}},{"result":{"nanos":659100,"startTime":1753623168590,"endTime":1753623168591,"millis":0.6591,"status":"passed"},"step":{"line":18,"prefix":"*","index":2,"text":"def organizer = username"}},{"result":{"nanos":30736300,"startTime":1753623168591,"endTime":1753623168622,"millis":30.7363,"status":"passed"},"step":{"line":19,"prefix":"*","index":3,"text":"def startTime = java.time.ZonedDateTime.now(java.time.ZoneOffset.UTC).withHour(10).withMinute(0).withSecond(0).withNano(0).format(java.time.format.DateTimeFormatter.ofPattern(\"yyyyMMdd'T'HHmmss'Z'\"))"}},{"result":{"nanos":8657400,"startTime":1753623168622,"endTime":1753623168631,"millis":8.6574,"status":"passed"},"step":{"line":20,"prefix":"*","index":4,"text":"def endTime = java.time.ZonedDateTime.now(java.time.ZoneOffset.UTC).withHour(11).withMinute(0).withSecond(0).withNano(0).format(java.time.format.DateTimeFormatter.ofPattern(\"yyyyMMdd'T'HHmmss'Z'\"))"}},{"result":{"nanos":349700,"startTime":1753623168631,"endTime":1753623168631,"millis":0.3497,"status":"passed"},"step":{"endLine":40,"comments":["# Define appointment request body"],"line":22,"prefix":"*","docString":"<CreateAppointmentRequest xmlns=\"urn:zimbraMail\">\n  <m>\n    <inv method=\"REQUEST\" type=\"event\" fb=\"B\" transp=\"O\" allDay=\"0\"\n         name=\"SUBJECT_VALUE\" loc=\"LOCATION_VALUE\">\n      <at role=\"OPT\" ptst=\"NE\" rsvp=\"1\" a=\"ATTENDEE_VALUE\"\/>\n      <s d=\"START_TIME_VALUE\"\/>\n      <e d=\"END_TIME_VALUE\"\/>\n      <or a=\"ORGANIZER_VALUE\"\/>\n    <\/inv>\n    <e a=\"ATTENDEE_VALUE\" t=\"t\"\/>\n    <mp content-type=\"text\/plain\">\n      <content>CONTENT_VALUE<\/content>\n    <\/mp>\n    <su>SUBJECT_VALUE<\/su>\n  <\/m>\n<\/CreateAppointmentRequest>","index":5,"text":"text appointmentBodyRaw ="}},{"result":{"nanos":45836500,"startTime":1753623168631,"endTime":1753623168677,"millis":45.8365,"status":"passed"},"step":{"line":41,"prefix":"*","index":6,"text":"def processedBody = appointmentBodyRaw.replaceAll('SUBJECT_VALUE', appointment.subject).replaceAll('LOCATION_VALUE', appointment.location).replaceAll('CONTENT_VALUE', appointment.content).replaceAll('ATTENDEE_VALUE', attendee).replaceAll('ORGANIZER_VALUE', organizer).replaceAll('START_TIME_VALUE', startTime).replaceAll('END_TIME_VALUE', endTime)"}},{"result":{"nanos":20661300,"startTime":1753623168678,"endTime":1753623168699,"millis":20.6613,"status":"passed"},"step":{"comments":["# Process template to create final SOAP request"],"line":43,"prefix":"*","index":7,"text":"def soapEnvelope = XmlTemplateProcessor.processTemplate('src\/test\/resources\/requests\/soap-envelope.xml', processedBody)"}},{"result":{"nanos":5305800,"startTime":1753623168698,"endTime":1753623168703,"millis":5.3058,"status":"passed"},"step":{"line":44,"prefix":"*","index":8,"text":"def finalSoapRequest = soapEnvelope.replace('#(authToken)', authToken).replace('#(csrfToken)', csrfToken)"}},{"result":{"nanos":1651700,"startTime":1753623168704,"endTime":1753623168706,"millis":1.6517,"status":"passed"},"step":{"line":45,"prefix":"*","index":9,"text":"print 'Final SOAP Request:', finalSoapRequest"},"stepLog":"19:02:48.706 [print] Final SOAP Request: <soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\r\n  <soap:Header>\r\n    <context xmlns=\"urn:zimbra\">\r\n      <authToken>0_5b274af34569381f5c166b1dfc808d426cc4c1ad_69643d33363a38303439303461372d346463302d346365642d626437332d6136393836376563653234383b6578703d31333a313735333739353936353333383b747970653d363a7a696d6272613b753d313a613b7469643d393a3337353939323531313b76657273696f6e3d31343a31302e312e305f47415f343635353b637372663d313a313b<\/authToken>\r\n      <csrfToken>0_b5ec7042a8441bb6bd0cdc9da3d21567ee04afd4<\/csrfToken>\r\n    <\/context>\r\n  <\/soap:Header>\r\n  <soap:Body>\r\n    <CreateAppointmentRequest xmlns=\"urn:zimbraMail\">\r\n  <m>\r\n    <inv allDay=\"0\" fb=\"B\" loc=\"Conference Room A\" method=\"REQUEST\" name=\"Team Meeting\" transp=\"O\" type=\"event\">\r\n      <at a=\"qauser_f8b093fa@qa-u56-singlenode-ps.eng.zimbra.com\" ptst=\"NE\" role=\"OPT\" rsvp=\"1\"\/>\r\n      <s d=\"20250727T100000Z\"\/>\r\n      <e d=\"20250727T110000Z\"\/>\r\n      <or a=\"xyz2313490priyankatalekar5@qa-u56-singlenode-ps.eng.zimbra.com\"\/>\r\n    <\/inv>\r\n    <e a=\"qauser_f8b093fa@qa-u56-singlenode-ps.eng.zimbra.com\" t=\"t\"\/>\r\n    <mp content-type=\"text\/plain\">\r\n      <content>Discuss project updates<\/content>\r\n    <\/mp>\r\n    <su>Team Meeting<\/su>\r\n  <\/m>\r\n<\/CreateAppointmentRequest>\r\n  <\/soap:Body>\r\n<\/soap:Envelope> \n"},{"result":{"nanos":536700,"startTime":1753623168706,"endTime":1753623168707,"millis":0.5367,"status":"passed"},"step":{"line":46,"prefix":"Given","index":10,"text":"request finalSoapRequest"}},{"result":{"nanos":903400,"startTime":1753623168707,"endTime":1753623168708,"millis":0.9034,"status":"passed"},"step":{"line":47,"prefix":"And","index":11,"text":"header Content-Type = 'application\/soap+xml'"}},{"result":{"nanos":4567500,"startTime":1753623168708,"endTime":1753623168713,"millis":4.5675,"status":"passed"},"step":{"line":48,"prefix":"*","index":12,"text":"configure ssl = true"}},{"result":{"nanos":163436600,"startTime":1753623168712,"endTime":1753623168875,"millis":163.4366,"status":"passed"},"step":{"line":49,"prefix":"When","index":13,"text":"method POST"},"stepLog":"19:02:48.714 request:\n1 > POST https:\/\/80.225.207.85\/service\/soap\/\n1 > Content-Type: application\/soap+xml; charset=UTF-8\n1 > Content-Length: 1287\n1 > Host: 80.225.207.85\n1 > Connection: Keep-Alive\n1 > User-Agent: Apache-HttpClient\/4.5.14 (Java\/21.0.7)\n1 > Accept-Encoding: gzip,deflate\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\r\n  <soap:Header>\r\n    <context xmlns=\"urn:zimbra\">\r\n      <authToken>0_5b274af34569381f5c166b1dfc808d426cc4c1ad_69643d33363a38303439303461372d346463302d346365642d626437332d6136393836376563653234383b6578703d31333a313735333739353936353333383b747970653d363a7a696d6272613b753d313a613b7469643d393a3337353939323531313b76657273696f6e3d31343a31302e312e305f47415f343635353b637372663d313a313b<\/authToken>\r\n      <csrfToken>0_b5ec7042a8441bb6bd0cdc9da3d21567ee04afd4<\/csrfToken>\r\n    <\/context>\r\n  <\/soap:Header>\r\n  <soap:Body>\r\n    <CreateAppointmentRequest xmlns=\"urn:zimbraMail\">\r\n  <m>\r\n    <inv allDay=\"0\" fb=\"B\" loc=\"Conference Room A\" method=\"REQUEST\" name=\"Team Meeting\" transp=\"O\" type=\"event\">\r\n      <at a=\"qauser_f8b093fa@qa-u56-singlenode-ps.eng.zimbra.com\" ptst=\"NE\" role=\"OPT\" rsvp=\"1\"\/>\r\n      <s d=\"20250727T100000Z\"\/>\r\n      <e d=\"20250727T110000Z\"\/>\r\n      <or a=\"xyz2313490priyankatalekar5@qa-u56-singlenode-ps.eng.zimbra.com\"\/>\r\n    <\/inv>\r\n    <e a=\"qauser_f8b093fa@qa-u56-singlenode-ps.eng.zimbra.com\" t=\"t\"\/>\r\n    <mp content-type=\"text\/plain\">\r\n      <content>Discuss project updates<\/content>\r\n    <\/mp>\r\n    <su>Team Meeting<\/su>\r\n  <\/m>\r\n<\/CreateAppointmentRequest>\r\n  <\/soap:Body>\r\n<\/soap:Envelope>\n\n19:02:48.869 response time in milliseconds: 153\n1 < 200\n1 < Server: nginx\n1 < Date: Sun, 27 Jul 2025 13:32:45 GMT\n1 < Content-Type: text\/xml;charset=utf-8\n1 < Content-Length: 313\n1 < Connection: keep-alive\n1 < Cache-Control: no-store, no-cache\n1 < Vary: Accept-Encoding, User-Agent\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><soap:Header><context xmlns=\"urn:zimbra\"><change token=\"1141\"\/><\/context><\/soap:Header><soap:Body><CreateAppointmentResponse calItemId=\"298\" rev=\"1139\" ms=\"1139\" invId=\"298-297\" apptId=\"298\" xmlns=\"urn:zimbraMail\"\/><\/soap:Body><\/soap:Envelope>\n\n"},{"result":{"nanos":35300,"startTime":1753623168876,"endTime":1753623168876,"millis":0.0353,"status":"passed"},"step":{"line":50,"prefix":"Then","index":14,"text":"status 200"}}],"executorName":"main","line":14,"name":"Create appointment using XML template","description":"","durationMillis":1948.7646,"startTime":1753623166552,"failed":false,"refId":"[1:14]","endTime":1753623168876,"exampleIndex":-1}],"callDepth":0,"name":"Create Zimbra Appointment","description":"","resultDate":"2025-07-27 07:02:48 pm","durationMillis":1948.7646,"passedCount":1}